src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияПриПолученииДанныхОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакЗагружать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийПриПолученииДанныхОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияПоискаПоКлючам</Name>
					<Comment>Может принимать значения "Оптимально" или "Стандарт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияУстановленыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтратегииПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Помощником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУстанавливать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыДействийПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПриПолученииДанныхОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПослеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ОбъектыКПоискуИУстановкеСоответствий/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры(); 
	
	ИнициализироватьДанныеФормы();
	
	ЗаполнитьТаблицуТиповОбъектов();
	
	ЗаполнитьСписокВыбораОбъектыМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ПроверитьНеобходимостьПолученияДополнительныхДанных", 0.2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.ОбработатьСохраненныеНастройкиОтбораОбъектыМетаданныхПередЗагрузкой(
		Настройки, ДоступныеДляОтбораТипыОбъектов, ОбъектыМетаданныхОтбор, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПричинаДобавленияОбъектыКЗагрузке" Тогда
		
		Элементы.Список.Обновить();
		ОбновитьТипыОбъектов(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ДекорацияДействияПриПолученииДанныхОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуДействияПриПолученияДанных" Тогда 
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииПоРаботеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СтрНайти(ДанныеСобытия.Href, "ОткрытьФормуНастройкиДействий") > 0 Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы);
		
	КонецЕсли;
	
КонецПроцедуры

#Область МножественныйОтборСписка 

&НаКлиенте
Процедура ОбъектыМетаданныхОтборПриИзменении(Элемент)
	
	УстановитьОтборТипМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.МножественныйОтборСпискаНачалоВыбора(ЭтотОбъект,
	                                                                     Элемент,
	                                                                     ОбъектыМетаданныхОтбор,
	                                                                     Неопределено,
	                                                                     НСтр("ru = 'Выбранные типы объектов'"),
	                                                                     ДоступныеДляОтбораТипыОбъектов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РаботаСРезультатамиОбмена.ПолучитьПредставленияОбъектовПриПолученииДанныхНаСервереСписка(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокПредставлениеОбъекта" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСсылкаНаОбъект) Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.ВнешняяСсылкаНаОбъект);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокСоответствиеВИБ" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
			ПоказатьЗначение(, ТекущиеДанные.СоответствиеВИБ);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуПроблемы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыОбъектов 

&НаКлиенте
Процедура ТипыОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = ТипыОбъектов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = Элементы.ТипыОбъектовОбъектыБезСоответствий.Имя Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ИдентификаторОбъектаМетаданных", ДанныеСтроки.ИдентификаторОбъектаМетаданных);
		ПараметрыОткрытия.Вставить("УзелИнформационнойБазы",         УзелИнформационнойБазы);
		
		ОповещениеОЗакрытииФормыСопоставления = Новый ОписаниеОповещения("ПослеЗакрытияФормыСопоставления", ЭтотОбъект); 
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.УстановкаСоответствий", ПараметрыОткрытия, ЭтотОбъект,
		              ,,,ОповещениеОЗакрытииФормыСопоставления, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СписокОбъектов

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНеобходимостьПоискаСоответствий(Команда)
	
	ОчиститьСообщения();
	
	ТипыОбъектовКОтмене = Новый Массив;
	
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ТипыОбъектов.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТипыОбъектов.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		Если ДанныеСтроки <> Неопределено
			И ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторОбъектаМетаданных) Тогда
			
			ТипыОбъектовКОтмене.Добавить(ДанныеСтроки.ИдентификаторОбъектаМетаданных);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипыОбъектовКОтмене.Количество() > 0 Тогда
		
		РезультатОтмены = РезультатОтменыНеобходимостиПоискаСоответствий(ТипыОбъектовКОтмене, УзелИнформационнойБазы);
		
		ОбработатьРезультатыОтменыНеобходимостиПоискаСоответствий(РезультатОтмены);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не выбран ни один тип объекта для отмены необходимости поиска сопоставлений'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ТипыОбъектов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъектИзФормыСписка(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствияВФормеСписка(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьЗагрузкуВыделенныхОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	ЗагрузитьВыделенныеОбъекты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СписокТиповОбъектов

&НаКлиенте
Процедура ЗагрузитьКакНовые(Команда)
	
	ЗагрузитьВыделенныеТипыОбъектов(ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.НеУстанавливать"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоКлючевымПолям(Команда)
	
	ЗагрузитьВыделенныеТипыОбъектов(ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.Автоматически"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗагрузкуВыделенныхТиповОбъектов(Команда)
	
	ОтклонитьЗагрузкуВыделенныхВСпискеТиповОбъектов()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипыОбъектов(Команда)
	
	ТипыОбъектов.Очистить();
	
	ЗаполнитьТаблицуТиповОбъектов();
	
	ТребуетсяПолучениеДанныхУстановленныхСоответствий = Истина;
	
	ПодключитьОбработчикОжидания("ПроверитьНеобходимостьПолученияДополнительныхДанных", 0.2, Истина);

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	
	СортироватьТаблицуТипыОбъектов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	
	СортироватьТаблицуТипыОбъектов(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ИнициализацияФормы

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	РаботаСРезультатамиОбмена.УстановитьУсловноеОформлениеИдентификаторПолученногоОбъекта(СписокУсловноеОформление, "ПредставлениеОбъекта");
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УзелПланаОбмена", УзелИнформационнойБазы, Истина);
	НавигационнаяСсылкаФормы = РаботаСРезультатамиОбмена.НавигационнаяСсылкаФормыСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДанныеФормы()

	РекомендацииПоРаботе = Обработки.РаботаСРезультатамиОбмена.ПолучитьМакет("РекомендацииПоРаботеПоискСоответствий").ПолучитьТекст();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбъектыМетаданных()
	
	ТипыПричин = Новый Массив;
	ТипыПричин.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия);
	
	ДоступныеДляОтбораТипыОбъектов = РегистрыСведений.ОбъектыКЗагрузке.ТипыОбъектовМетаданныхСПроблемами(
		УзелИнформационнойБазы, ТипыПричин);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеТаблицыТипыОбъектов

&НаСервере
Процедура ЗаполнитьТаблицуТиповОбъектов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя                КАК ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданных.Синоним                  КАК Синоним,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                         КАК ОбъектМетаданных,
	|	КОЛИЧЕСТВО(ОбъектыКЗагрузке.ОбъектМетаданных)             КАК КоличествоОбъектов
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО ИдентификаторыОбъектовМетаданных.Ссылка = ОбъектыКЗагрузке.ОбъектМетаданных
	|ГДЕ
	|	ОбъектыКЗагрузке.ПричинаДобавления = ЗНАЧЕНИЕ(Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия)
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелПланаОбмена
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыКЗагрузке.ОбъектМетаданных,
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданных.Синоним";
	
	Запрос.УстановитьПараметр("УзелПланаОбмена", УзелИнформационнойБазы);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ТипыОбъектов.Добавить();
		
		СтрокаТаблицы.ИдентификаторОбъектаМетаданных        = Выборка.ОбъектМетаданных;
		СтрокаТаблицы.ОбъектыБезСоответствий                = Выборка.КоличествоОбъектов;
		СтрокаТаблицы.СинонимОбъектаМетаданных              = Выборка.Синоним;
		СтрокаТаблицы.ИндексКартинки                        = РаботаСРезультатамиОбмена.ИндексКартинкиТипаОбъектовМетаданных(Выборка.ПолноеИмя);
		СтрокаТаблицы.ПолноеИмяТипаОбъекта                  = Выборка.ПолноеИмя;
		СтрокаТаблицы.ДанныеБезСоответствияВИБНеПолучены     = Истина;
		
		ТребуетсяПолучениеДанныхУстановленныхСоответствий = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьТаблицуТипыОбъектов(ПоВозрастанию)
	
	ОчиститьСообщения();
	
	ТекущаяКолонка = Элементы.ТипыОбъектов.ТекущийЭлемент;
	
	ТипСортировки = "";
	
	Если ТекущаяКолонка = Элементы.ТипыОбъектовОбъектыБезСоответствий Тогда
		
		ТипСортировки = "ОбъектыБезСоответствий";
		
		
	ИначеЕсли ТекущаяКолонка = Элементы.ТипыОбъектовСинонимОбъектаМетаданных
		Или ТекущаяКолонка = Элементы.ТипыОбъектовИндексКартинки Тогда
		
		ТипСортировки = "СинонимОбъектаМетаданных";
		
	КонецЕсли;
	
	Если ПустаяСтрока(ТипСортировки) Тогда
		
		ТекстСообщения = НСтр("ru = 'Сортировка не может быть выполнена по данной колонке.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если ПоВозрастанию Тогда
		ТипСортировки = ТипСортировки + " " + "Возр";
	Иначе
		ТипСортировки = ТипСортировки + " " + "Убыв";
	КонецЕсли;
	
	ТипыОбъектов.Сортировать(ТипСортировки);
	
КонецПроцедуры

#КонецОбласти

#Область ЗакрытиеФормыУстановкиСоответствий

&НаКлиенте
Процедура ПослеЗакрытияФормыСопоставления(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ОткрытьФормуПроблемы(ТекущиеДанные)
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект, 
		ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия"), ОповещениеОЗакрытииФормыПроблемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.УстановленоСоответствие Тогда
		
		ПроверитьБлокируемыеОбъектыФоновоеЗадание(Результат.ПолученныйОбъект, Результат.ОбъектФормата, УзелИнформационнойБазы, Результат.ИдентификаторФоновогоЗадания);
		
	КонецЕсли;
		
	Если Результат.ОткрытьОбъектИБПослеОбработки
		И ЗначениеЗаполнено(Результат.ОбъектИБ) Тогда
		
		ПоказатьЗначение(, Результат.ОбъектИБ);
		
	ИначеЕсли Результат.ПереоткрытьФормуПроблему Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПереоткрытьФормуПроблемыПослеОтработки(ЭтотОбъект, Результат);
		
	ИначеЕсли Результат.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		ПоказатьПредупреждение(,Результат.ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеОтборов

&НаКлиенте
Процедура ФормаМножественногоОтбораПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("Элемент") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.ОбъектыМетаданныхОтбор Тогда
		
		ОбъектыМетаданныхОтбор = Результат;
		УстановитьОтборТипМетаданных();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборТипМетаданных()
	
	РаботаСРезультатамиОбмена.УстановитьОтборТипМетаданныхВСписке(Список, ОбъектыМетаданныхОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода",
		Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 
		?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(Дата(3999, 12, 31)))); 
		
	Элементы.ДекорацияОтборПериод.Заголовок = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания,);
	
КонецПроцедуры

#КонецОбласти 

#Область ДополнительныеДанныеУстановленныхСоответствий

&НаКлиенте
Процедура ПроверитьНеобходимостьПолученияДополнительныхДанных()

	Если ТребуетсяПолучениеДанныхУстановленныхСоответствий Тогда
		
		ПолучитьДанныеУстановленныхСоответствий();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеУстановленныхСоответствий()

	ТребуетсяПолучениеДанныхУстановленныхСоответствий = Ложь;
	
	ДанныеДляПолучения = ДанныеДляПолученияУстановленныхСоответствий();
	
	Если ДанныеДляПолучения.ИменаОбъектовМетаданных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияПолученияУстановленныхСоответствий(ДанныеДляПолучения,
	                                                                         УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИменаОбъектовМетаданных", ДанныеДляПолучения.ИменаОбъектовМетаданных);
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьДанныеУстановленныхСоответствийЗавершение(ДлительнаяОперация, ДополнительныеПараметры);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеУстановленныхСоответствийЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеУстановленныхСоответствийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ВывестиДанныеУстановленныхСоответствий(Результат.АдресРезультата, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиДанныеУстановленныхСоответствий(АдресРезультата, ДополнительныеПараметры)

	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеУстановленныхСоответствий = ДанныеВременногоХранилища(АдресРезультата);
	
	Если ДанныеУстановленныхСоответствий = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеУстановленныхСоответствий) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТипОбъекты Из ТипыОбъектов Цикл
		
		ДанныеПоОбъекту = ДанныеУстановленныхСоответствий.Получить(СтрокаТипОбъекты.ПолноеИмяТипаОбъекта);
		
		Если ДанныеПоОбъекту = Неопределено Тогда
			
			ВывестиИнформациюПоПредставлениюВСтроку(СтрокаТипОбъекты, 0, 0);
			
		Иначе
			
			ВывестиИнформациюПоПредставлениюВСтроку(СтрокаТипОбъекты, 
			                                        ДанныеПоОбъекту.КоличествоУстановленныхСоответствий,
			                                        ДанныеПоОбъекту.КоличествоОбъектовВБазе);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюПоПредставлениюВСтроку(СтрокаТипОбъекты, КоличествоУстановленныхСоответствий, КоличествоОбъектовВБазе)
	
	СтрокаТипОбъекты.БезСоответствияВИБ                 = СтрШаблон("%1 из %2", КоличествоОбъектовВБазе - КоличествоУстановленныхСоответствий, КоличествоОбъектовВБазе);
	СтрокаТипОбъекты.ДанныеБезСоответствияВИБНеПолучены  = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПолученияУстановленныхСоответствий(ДанныеДляПолучения, УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДанныеДляПолучения", ДанныеДляПолучения);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных количество установленных соответствий по объектам'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПолучитьДанныеУстановленныхСоответствийПоОбъектам",
		                                                    ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеВременногоХранилища(АдресВременногоХранилища)
	
	Возврат ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
КонецФункции

&НаКлиенте
Функция ДанныеДляПолученияУстановленныхСоответствий()

	ДанныеДляПолучения = Новый Структура;
	ДанныеДляПолучения.Вставить("УзелИнформационнойБазы",  УзелИнформационнойБазы);
	ДанныеДляПолучения.Вставить("ИменаОбъектовМетаданных", Новый Массив);
	
	Для Каждого СтрокаТипов Из ТипыОбъектов Цикл
		
		ДанныеДляПолучения.ИменаОбъектовМетаданных.Добавить(СтрокаТипов.ПолноеИмяТипаОбъекта);
		
	КонецЦикла;
	
	Возврат ДанныеДляПолучения;

КонецФункции 

#КонецОбласти

#Область ОтменаНеобходимостиПодтверждения

&НаСервере
Функция РезультатОтменыНеобходимостиПоискаСоответствий(ТипыОбъектовКОтмене, УзелИнформационнойБазы)
	
	Возврат РегистрыСведений.ДействияПриПолученииДанныхОбмена.РезультатОтменыНеобходимостиПоискаСоответствий(ТипыОбъектовКОтмене, УзелИнформационнойБазы);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатыОтменыНеобходимостиПоискаСоответствий(РезультатОтмены)

	Если РезультатОтмены.Успешно Тогда
		
		Если РезультатОтмены.Изменено = 0 Тогда
			
			ТекстПояснения = НСтр("ru = 'Ни для одного объекта изменения не выполнены'");
			
		Иначе
			
			ТекстПояснения = СтрШаблон(НСтр("ru = 'Изменения выполнены для типов объектов - %1 из %2'"), РезультатОтмены.Изменено, РезультатОтмены.КИзменению);
			
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена необходимости поиска соответствий'"),, ТекстПояснения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отменить необходимость поиска соответствий по причине: %1'"), РезультатОтмены.ТекстОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ТипыОбъектов");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаСоответствия

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		УжеСопоставленныеИдентификаторы = РезультатПроверкиВыбранногоСоответствия(Результат);
		
		Если УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда 
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры,
			                                                                       УзелИнформационнойБазы,
			                                                                       ДополнительныеПараметры.ТекущиеДанные);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат, ДополнительныеПараметры);
			
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатЗагрузкиОбъектаИзФормыПроблемы(ДанныеОбъектаКОбработке);
	
КонецФункции

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект, ДополнительныеПараметры)
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.НовыйДанныеПроблемыКОбработке();

	ДанныеОбъектаКОбработке.ПолученныйОбъект               = ДополнительныеПараметры.ПолученныйОбъект;
	ДанныеОбъектаКОбработке.ПравилоКонвертации             = ДополнительныеПараметры.ПравилоКонвертации;
	ДанныеОбъектаКОбработке.ОбъектФормата                  = ДополнительныеПараметры.ОбъектФормата;
	ДанныеОбъектаКОбработке.УзелПланаОбмена                = УзелИнформационнойБазы;
	ДанныеОбъектаКОбработке.СоответствиеВИБ                = ВыбранныйОбъект;
	ДанныеОбъектаКОбработке.УстановленноеСоответствие      = ВыбранныйОбъект;
	ДанныеОбъектаКОбработке.ДатаУстановкиПричиныДобавления = ДополнительныеПараметры.ТекущиеДанные.ДатаВозникновения;
	ДанныеОбъектаКОбработке.ДатаОбрабатываемойВерсии       = ДополнительныеПараметры.ТекущиеДанные.ДатаОбрабатываемойВерсии;
	ДанныеОбъектаКОбработке.ПричинаДобавления              = ДополнительныеПараметры.ТекущиеДанные.ПричинаДобавления;
	
	РезультатЗагрузкиОбъекта = РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке);
	
	Если Не РезультатЗагрузкиОбъекта.Успешно Тогда
		
		Для Каждого ТекстОшибки Из РезультатЗагрузкиОбъекта.Ошибки Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		
	Иначе
		
		РезультатОбработки = Новый Структура;
		РезультатОбработки.Вставить("НовыеПричины",         РезультатЗагрузкиОбъекта.РезультатОбработки);
		РезультатОбработки.Вставить("ОповещатьОбИзменении", Истина);
		
		РаботаСРезультатамиОбменаКлиент.ОповеститьПользователяОРезультатахВыполненияГрупповойКоманды(РезультатОбработки, Ложь);
		
		Если РезультатЗагрузкиОбъекта.УстановленныеСоответствия.Количество() > 0  Тогда
		
			ПроверитьБлокируемыеОбъектыФоновоеЗадание(ДополнительныеПараметры.ПолученныйОбъект,
			                                          ДополнительныеПараметры.ОбъектФормата,
			                                          УзелИнформационнойБазы,
			                                          РезультатЗагрузкиОбъекта.ИдентификаторФоновогоЗадания);
			
		КонецЕсли;
		
		Элементы.Список.Обновить();
		ОбновитьТипыОбъектов(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект)
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);
	
КонецФункции 

&НаКлиенте
Процедура ПроверитьБлокируемыеОбъектыФоновоеЗадание(ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы, КлючФоновогоЗадания)
	
	ДлительнаяОперация = ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, 
		КлючФоновогоЗадания,
		ПолученныйОбъект,
		ОбъектФормата,
		УзелИнформационнойБазы);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПослеУстановкиСоответствия(УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы)
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(Результат.АдресРезультата, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтклонениеЗагрузкиОбъектов

&НаКлиенте
Процедура ОтклонитьЗагрузкуВыделенныхОбъектов()
	
	ОчиститьСообщения();
	
	КлючиЗаписейКОбработке = РаботаСРезультатамиОбменаКлиент.КлючиЗаписейВыделенныхСтрокСписка(ЭтотОбъект, "Список");
	
	Если КлючиЗаписейКОбработке.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке);
	
	РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныЗагрузкаОтклонена(РезультатИзмененияПричины);
	
	УдалитьОтклоненныеЗаписиФоновымЗаданием(РезультатИзмененияПричины);
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке)

	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке);

КонецФункции

&НаКлиенте
Процедура УдалитьОтклоненныеЗаписиФоновымЗаданием(РезультатИзмененияПричины)
	
	Если РезультатИзмененияПричины.КоличествоОбработано = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперацияУдаленияОтклоненныхЗаписей(
		УникальныйИдентификатор, 
		РезультатИзмененияПричины.ИдентификаторФоновогоЗадания);

КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияУдаленияОтклоненныхЗаписей(УникальныйИдентификатор, КлючФоновогоЗадания)
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияУдаленияОтклоненныхЗаписей(
		УникальныйИдентификатор, КлючФоновогоЗадания);
	
КонецФункции

#КонецОбласти

#Область ОтклонениеЗагрузкиВыделенныхТиповОбъектов

&НаКлиенте
Процедура ОтклонитьЗагрузкуВыделенныхВСпискеТиповОбъектов()
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.ТипыОбъектов.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного типа объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ТипыОбъектовКОбработке = ВыделенныеВСпискеТипыОбъектов();
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныЗагрузкаОтклоненаДляТиповОбъекта(ТипыОбъектовКОбработке);
	
	РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныЗагрузкаОтклонена(РезультатИзмененияПричины);
	
	УдалитьОтклоненныеЗаписиФоновымЗаданием(РезультатИзмененияПричины);
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныЗагрузкаОтклоненаДляТиповОбъекта(ТипыОбъектовКОбработке)
	
	КлючиЗаписейКОбработке = КлючиЗаписейКОбработке(ТипыОбъектовКОбработке);
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныЗагрузкаОтклонена(КлючиЗаписейКОбработке);
	
КонецФункции

&НаСервере
Функция КлючиЗаписейКОбработке(ТипыОбъектовКОбработке)
	
	ПричиныДобавления = Новый Массив;
	ПричиныДобавления.Добавить(Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия);
	
	Возврат РегистрыСведений.ОбъектыКЗагрузке.КлючиЗаписейПоТипамОбъектовИПричинамДобавления(
		УзелИнформационнойБазы,ТипыОбъектовКОбработке, ПричиныДобавления);
	
КонецФункции

&НаКлиенте
Функция ВыделенныеВСпискеТипыОбъектов()

	ТипыОбъектовКОбработке = Новый Массив;
	Для Каждого ИдентификаторСтроки Из Элементы.ТипыОбъектов.ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТипыОбъектов.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если ДанныеСтроки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипыОбъектовКОбработке.Добавить(ДанныеСтроки.ИдентификаторОбъектаМетаданных);
		
	КонецЦикла;
	
	Возврат ТипыОбъектовКОбработке;

КонецФункции

#КонецОбласти

#Область ПодтверждениеЗагрузкиОбъекты

&НаКлиенте
Процедура ЗагрузитьВыделенныеОбъекты()
	
	ОчиститьСообщения();
	
	КлючиЗаписейКОбработке = РаботаСРезультатамиОбменаКлиент.КлючиЗаписейВыделенныхСтрокСписка(ЭтотОбъект, "Список");
	
	Если КлючиЗаписейКОбработке.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ЗагрузитьОбъекты(КлючиЗаписейКОбработке);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъекты(КлючиЗаписейКОбработке)

	РезультатИзмененияПричины = РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке);
	
	РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныГотовКЗагрузке(РезультатИзмененияПричины);
	
	ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины, ПредопределенноеЗначение("Перечисление.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных.НеУстанавливать"));

КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины, ПараметрыЗагрузки)
	
	Если РезультатИзмененияПричины.КоличествоОбработано = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияЗагрузкиОбъектов(
		УникальныйИдентификатор, 
		РезультатИзмененияПричины.ИдентификаторФоновогоЗадания,
		ПараметрыЗагрузки); 
		
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ЗагрузитьОбъектыФоновымЗаданиемЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьОбъектыФоновымЗаданиемЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъектыФоновымЗаданиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(Результат.АдресРезультата, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗагрузкиОбъектов(УникальныйИдентификатор, КлючФоновогоЗадания, ВариантУстановкиСоответствия)
	
	ПараметрыПередачи = РаботаСРезультатамиОбмена.НовыйПараметрыПередачиОбъектовНаЗагрузку();
	
	ПараметрыПередачи.НеПроверятьОсвободившиесяОбъектыПриЗаписиВПИСО = Истина;
	ПараметрыПередачи.ИспользоватьПереданныеДействияПриПолучении     = Истина; 
	
	ПараметрыПередачи.ДействияПриПолучении.УстанавливатьСоответствия = ВариантУстановкиСоответствия;
	ПараметрыПередачи.ДействияПриПолучении.КакЗагружать              = Перечисления.ВариантыДействийПриПолученииДанныхОбмена.Автоматически;
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияЗагрузкиОбъектов(
		УникальныйИдентификатор,
		УзелИнформационнойБазы,
		КлючФоновогоЗадания,
		ПараметрыПередачи);
	
КонецФункции

#КонецОбласти

#Область ПодтверждениеЗагрузкиТипыОбъектов

&НаКлиенте
Процедура ЗагрузитьВыделенныеТипыОбъектов(ВариантУстановкиСоответствия)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = Элементы.ТипыОбъектов.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного типа объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ТипыОбъектовКОбработке = ВыделенныеВСпискеТипыОбъектов();
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныГотовКЗагрузкеДляТиповОбъектов(ТипыОбъектовКОбработке);
	
	РаботаСРезультатамиОбменаКлиент.ОповеститьОРезультатахУстановкиПричиныГотовКЗагрузке(РезультатИзмененияПричины);
	
	ЗагрузитьОбъектыФоновымЗаданием(РезультатИзмененияПричины, ВариантУстановкиСоответствия);
	
КонецПроцедуры

&НаСервере
Функция РезультатУстановкиПричиныГотовКЗагрузкеДляТиповОбъектов(ТипыОбъектовКОбработке)
	
	КлючиЗаписейКОбработке = КлючиЗаписейКОбработке(ТипыОбъектовКОбработке);
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныГотовКЗагрузке(КлючиЗаписейКОбработке);
	
КонецФункции

#КонецОбласти

#КонецОбласти
